In [91]:
pip install openpyxl

Collecting openpyxlNote: you may need to restart the kernel to use updated packages.

  Downloading openpyxl-3.0.10-py2.py3-none-any.whl (242 kB)
     ------------------------------------ 242.1/242.1 kB 176.6 kB/s eta 0:00:00
Collecting et-xmlfile
  Downloading et_xmlfile-1.1.0-py3-none-any.whl (4.7 kB)
Installing collected packages: et-xmlfile, openpyxl
Successfully installed et-xmlfile-1.1.0 openpyxl-3.0.10

WARNING: There was an error checking the latest version of pip.

In [1]:
import pandas as pd

In [2]:
df=pd.read_csv('D:/2021/Yearly Consolidated/BANKNIFTY.csv')     #importing the banknifty dataset

In [3]:
df.head()

      TICKER        DATE  TIME     OPEN     HIGH     LOW     CLOSE
0  BANKNIFTY  01/01/2021  9:16  31279.8  31359.0  31243.6  31337.3
1  BANKNIFTY  01/01/2021  9:17  31337.7  31355.8  31309.8  31309.8
2  BANKNIFTY  01/01/2021  9:18  31308.8  31315.9  31297.1  31315.8
3  BANKNIFTY  01/01/2021  9:19  31317.9  31351.7  31317.9  31343.7
4  BANKNIFTY  01/01/2021  9:20  31342.4  31347.3  31328.2  31344.3

In [9]:
df.columns

Index(['TICKER', 'DATE', 'TIME', 'OPEN', 'HIGH', 'LOW ', 'CLOSE', 'RANGE'], dtype='object')

In [5]:
df.insert(7,column="RANGE",value=df["HIGH"]-df["LOW "])    #inserting the required range column

In [6]:
df.to_excel("BANKNIFTY_NEW.xlsx")                    #creating an excel file of the updated dataset

In [7]:
df1=pd.read_csv('D:/2021/Yearly Consolidated/NIFTY.csv')        #importing the nifty dataset

In [8]:
df1.head()

  TICKER        DATE   TIME     OPEN     HIGH      LOW    CLOSE
0  NIFTY  01-01-2021  09:16  13997.9  14020.8  13991.3  14013.2
1  NIFTY  01-01-2021  09:17  14014.8  14018.5  14008.2  14009.0
2  NIFTY  01-01-2021  09:18  14008.0  14013.1  14005.0  14012.7
3  NIFTY  01-01-2021  09:19  14013.7  14019.1  14013.7  14016.2
4  NIFTY  01-01-2021  09:20  14015.5  14017.8  14012.0  14015.5

In [10]:
df1.columns

Index(['TICKER', 'DATE', 'TIME', 'OPEN', 'HIGH', 'LOW', 'CLOSE'], dtype='object')

In [12]:
df1.insert(7,column="RANGE",value=df1["HIGH"]-df1["LOW"])     #inserting the required range column

In [13]:
df1.head()

  TICKER        DATE   TIME     OPEN     HIGH      LOW    CLOSE  RANGE
0  NIFTY  01-01-2021  09:16  13997.9  14020.8  13991.3  14013.2   29.5
1  NIFTY  01-01-2021  09:17  14014.8  14018.5  14008.2  14009.0   10.3
2  NIFTY  01-01-2021  09:18  14008.0  14013.1  14005.0  14012.7    8.1
3  NIFTY  01-01-2021  09:19  14013.7  14019.1  14013.7  14016.2    5.4
4  NIFTY  01-01-2021  09:20  14015.5  14017.8  14012.0  14015.5    5.8

In [14]:
df1.to_excel("NIFTY_NEW.xlsx")      #creating an excel file of the updated dataset